{"class_name": "Model", "config": {"name": "inception_resnet_v2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 50, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1conv2d", "class_name": "Conv2D", "config": {"name": "conv1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "conv1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1conv2d", 0, 0, {}]]]}, {"name": "conv1conv2dact", "class_name": "Activation", "config": {"name": "conv1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1conv2dbn", 0, 0, {}]]]}, {"name": "conv2conv2d", "class_name": "Conv2D", "config": {"name": "conv2conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1conv2dact", 0, 0, {}]]]}, {"name": "conv2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "conv2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2conv2d", 0, 0, {}]]]}, {"name": "conv2conv2dact", "class_name": "Activation", "config": {"name": "conv2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2conv2dbn", 0, 0, {}]]]}, {"name": "conv3conv2d", "class_name": "Conv2D", "config": {"name": "conv3conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2conv2dact", 0, 0, {}]]]}, {"name": "conv3conv2dbn", "class_name": "BatchNormalization", "config": {"name": "conv3conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3conv2d", 0, 0, {}]]]}, {"name": "conv3conv2dact", "class_name": "Activation", "config": {"name": "conv3conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_12conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_12conv2d", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3conv2dact", 0, 0, {}]]]}, {"name": "stem_br_12conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_12conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_12conv2d", 0, 0, {}]]]}, {"name": "stem_br_11_maxpool_1", "class_name": "MaxPooling2D", "config": {"name": "stem_br_11_maxpool_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv3conv2dact", 0, 0, {}]]]}, {"name": "stem_br_12conv2dact", "class_name": "Activation", "config": {"name": "stem_br_12conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_12conv2dbn", 0, 0, {}]]]}, {"name": "stem_concat_1", "class_name": "Concatenate", "config": {"name": "stem_concat_1", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["stem_br_11_maxpool_1", 0, 0, {}], ["stem_br_12conv2dact", 0, 0, {}]]]}, {"name": "stem_br_211conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_211conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_1", 0, 0, {}]]]}, {"name": "stem_br_211conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_211conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_211conv2d", 0, 0, {}]]]}, {"name": "stem_br_211conv2dact", "class_name": "Activation", "config": {"name": "stem_br_211conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_211conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_212conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_212conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_211conv2dact", 0, 0, {}]]]}, {"name": "stem_br_212conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_212conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_212conv2d", 0, 0, {}]]]}, {"name": "stem_br_212conv2dact", "class_name": "Activation", "config": {"name": "stem_br_212conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_212conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_213conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_213conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_212conv2dact", 0, 0, {}]]]}, {"name": "stem_br_221conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_221conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_1", 0, 0, {}]]]}, {"name": "stem_br_213conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_213conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_213conv2d", 0, 0, {}]]]}, {"name": "stem_br_221conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_221conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_221conv2d", 0, 0, {}]]]}, {"name": "stem_br_213conv2dact", "class_name": "Activation", "config": {"name": "stem_br_213conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_213conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_221conv2dact", "class_name": "Activation", "config": {"name": "stem_br_221conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_221conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_214conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_214conv2d", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_213conv2dact", 0, 0, {}]]]}, {"name": "stem_br_222conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_222conv2d", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_221conv2dact", 0, 0, {}]]]}, {"name": "stem_br_214conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_214conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_214conv2d", 0, 0, {}]]]}, {"name": "stem_br_222conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_222conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_222conv2d", 0, 0, {}]]]}, {"name": "stem_br_214conv2dact", "class_name": "Activation", "config": {"name": "stem_br_214conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_214conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_222conv2dact", "class_name": "Activation", "config": {"name": "stem_br_222conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_222conv2dbn", 0, 0, {}]]]}, {"name": "stem_concat_2", "class_name": "Concatenate", "config": {"name": "stem_concat_2", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["stem_br_214conv2dact", 0, 0, {}], ["stem_br_222conv2dact", 0, 0, {}]]]}, {"name": "stem_br_31conv2d", "class_name": "Conv2D", "config": {"name": "stem_br_31conv2d", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_2", 0, 0, {}]]]}, {"name": "stem_br_31conv2dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_31conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_31conv2d", 0, 0, {}]]]}, {"name": "stem_br_31conv2dact", "class_name": "Activation", "config": {"name": "stem_br_31conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_31conv2dbn", 0, 0, {}]]]}, {"name": "stem_br_32_maxpool_2", "class_name": "MaxPooling2D", "config": {"name": "stem_br_32_maxpool_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["stem_concat_2", 0, 0, {}]]]}, {"name": "stem_concat_3", "class_name": "Concatenate", "config": {"name": "stem_concat_3", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["stem_br_31conv2dact", 0, 0, {}], ["stem_br_32_maxpool_2", 0, 0, {}]]]}, {"name": "incresA_1b2_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b2_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_3", 0, 0, {}]]]}, {"name": "incresA_1b2_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b2_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b2_1conv2d", 0, 0, {}]]]}, {"name": "incresA_1b2_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b2_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b2_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1b1_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b1_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_3", 0, 0, {}]]]}, {"name": "incresA_1b2_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b2_2conv2d", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1b2_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_1b1_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b1_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b1_1conv2d", 0, 0, {}]]]}, {"name": "incresA_1b2_2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b2_2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b2_2conv2d", 0, 0, {}]]]}, {"name": "incresA_1b1_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b1_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b1_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1b2_2conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b2_2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b2_2conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1b0conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b0conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_3", 0, 0, {}]]]}, {"name": "incresA_1b1_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b1_2conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1b1_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_1b2_3conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1b2_3conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1b2_2conv2dact", 0, 0, {}]]]}, {"name": "incresA_1b0conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b0conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b0conv2d", 0, 0, {}]]]}, {"name": "incresA_1b1_2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b1_2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b1_2conv2d", 0, 0, {}]]]}, {"name": "incresA_1b2_3conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1b2_3conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1b2_3conv2d", 0, 0, {}]]]}, {"name": "incresA_1b0conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b0conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b0conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1b1_2conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b1_2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b1_2conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1b2_3conv2dact", "class_name": "Activation", "config": {"name": "incresA_1b2_3conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_1b2_3conv2dbn", 0, 0, {}]]]}, {"name": "incresA_1_concat", "class_name": "Concatenate", "config": {"name": "incresA_1_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["incresA_1b0conv2dact", 0, 0, {}], ["incresA_1b1_2conv2dact", 0, 0, {}], ["incresA_1b2_3conv2dact", 0, 0, {}]]]}, {"name": "incresA_1filt_exp_1x1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_1filt_exp_1x1conv2d", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1_concat", 0, 0, {}]]]}, {"name": "incresA_1filt_exp_1x1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_1filt_exp_1x1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_1filt_exp_1x1conv2d", 0, 0, {}]]]}, {"name": "incresA_1act_scaling", "class_name": "Lambda", "config": {"name": "incresA_1act_scaling", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPoePGlweXRob24taW5wdXQtMS1kZGI3YWQx\nZTc0MzU+2gg8bGFtYmRhPhUAAABzAAAAAA==\n", null, null], "module": "__main__", "function_type": "lambda", "output_shape": [21, 14, 384], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.15}}, "inbound_nodes": [[["stem_concat_3", 0, 0, {}], ["incresA_1filt_exp_1x1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b2_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b2_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1act_scaling", 0, 0, {}]]]}, {"name": "incresA_2b2_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b2_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b2_1conv2d", 0, 0, {}]]]}, {"name": "incresA_2b2_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b2_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b2_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b1_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b1_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1act_scaling", 0, 0, {}]]]}, {"name": "incresA_2b2_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b2_2conv2d", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2b2_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_2b1_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b1_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b1_1conv2d", 0, 0, {}]]]}, {"name": "incresA_2b2_2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b2_2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b2_2conv2d", 0, 0, {}]]]}, {"name": "incresA_2b1_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b1_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b1_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b2_2conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b2_2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b2_2conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b0conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b0conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_1act_scaling", 0, 0, {}]]]}, {"name": "incresA_2b1_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b1_2conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2b1_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_2b2_3conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2b2_3conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2b2_2conv2dact", 0, 0, {}]]]}, {"name": "incresA_2b0conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b0conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b0conv2d", 0, 0, {}]]]}, {"name": "incresA_2b1_2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b1_2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b1_2conv2d", 0, 0, {}]]]}, {"name": "incresA_2b2_3conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2b2_3conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2b2_3conv2d", 0, 0, {}]]]}, {"name": "incresA_2b0conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b0conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b0conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b1_2conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b1_2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b1_2conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2b2_3conv2dact", "class_name": "Activation", "config": {"name": "incresA_2b2_3conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_2b2_3conv2dbn", 0, 0, {}]]]}, {"name": "incresA_2_concat", "class_name": "Concatenate", "config": {"name": "incresA_2_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["incresA_2b0conv2dact", 0, 0, {}], ["incresA_2b1_2conv2dact", 0, 0, {}], ["incresA_2b2_3conv2dact", 0, 0, {}]]]}, {"name": "incresA_2filt_exp_1x1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_2filt_exp_1x1conv2d", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2_concat", 0, 0, {}]]]}, {"name": "incresA_2filt_exp_1x1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_2filt_exp_1x1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_2filt_exp_1x1conv2d", 0, 0, {}]]]}, {"name": "incresA_2act_scaling", "class_name": "Lambda", "config": {"name": "incresA_2act_scaling", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPoePGlweXRob24taW5wdXQtMS1kZGI3YWQx\nZTc0MzU+2gg8bGFtYmRhPhUAAABzAAAAAA==\n", null, null], "module": "__main__", "function_type": "lambda", "output_shape": [21, 14, 384], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.15}}, "inbound_nodes": [[["incresA_1act_scaling", 0, 0, {}], ["incresA_2filt_exp_1x1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_3b2_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b2_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2act_scaling", 0, 0, {}]]]}, {"name": "incresA_3b2_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_3b2_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_3b2_1conv2d", 0, 0, {}]]]}, {"name": "incresA_3b2_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_3b2_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_3b2_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_3b1_1conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b1_1conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2act_scaling", 0, 0, {}]]]}, {"name": "incresA_3b2_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b2_2conv2d", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_3b2_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_3b1_1conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_3b1_1conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_3b1_1conv2d", 0, 0, {}]]]}, {"name": "incresA_3b2_2conv2dbn", "class_name": "BatchNormalization", "config": {"name": "incresA_3b2_2conv2dbn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["incresA_3b2_2conv2d", 0, 0, {}]]]}, {"name": "incresA_3b1_1conv2dact", "class_name": "Activation", "config": {"name": "incresA_3b1_1conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_3b1_1conv2dbn", 0, 0, {}]]]}, {"name": "incresA_3b2_2conv2dact", "class_name": "Activation", "config": {"name": "incresA_3b2_2conv2dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["incresA_3b2_2conv2dbn", 0, 0, {}]]]}, {"name": "incresA_3b0conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b0conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_2act_scaling", 0, 0, {}]]]}, {"name": "incresA_3b1_2conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b1_2conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["incresA_3b1_1conv2dact", 0, 0, {}]]]}, {"name": "incresA_3b2_3conv2d", "class_name": "Conv2D", "config": {"name": "incresA_3b2_3conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", 